app/Http/Controllers/Admin/Orders/CreateOrder.php

	public function updatedUserNumber()
    {
        $this->validateUser();
        if ($this->details->count() == 0) {
            $this->user = User::where('mobile',$this->user_number)->first();
---
select * from `users` where `mobile` = '0' limit 1