app/Http/Controllers/Admin/Orders/IndexOrder.php

select count(*) as aggregate from `order_details` where `status` = 'wc-pending' and exists (select * from `products` where `order_details`.`product_id` = `products`.`id` and `products`.`deleted_at` is null) and `order_details`.`deleted_at` is null
---
    private function getCount($status)
    {
        return OrderDetail::when($this->category, function ($query) {
            return $query->whereHas('product', function ($query) {
                return $query->whereHas('category', function ($query) {
                    return $query->where('parent_id', $this->category);
                });
            });
        })->where('status', $status)->has('product')->count();