app/Http/Controllers/Site/Carts/CartComponent.php

select * from `products` where `products`.`id` = '48402' and `products`.`deleted_at` is null limit 1
---
    public function updated($name, $value)
    {
        $elements = explode('.', $name);

        if ($elements[0] == 'quantities'){
            $this->validate(['quantities.'.$elements[1] => ['required', 'integer', 'min:1', 'max:100']]);

            $product = Product::find($elements[1]);