app/Http/Controllers/Site/Carts/CartPaymentComponent.php

	public function checkProducts()
	{
		$productCats = [];
		$cart = false;
		foreach (Cart::content() as $item) {
			$product = Product::where('id',$item->id)->first();
---
select * from `products` where `id` = 187206 and `products`.`deleted_at` is null limit 1

    private function store($timer, $gateway = null, $transactionId = null)
    {
        $id = DB::transaction(function () use ($timer, $gateway, $transactionId) {

            $voucherId = null;
            $voucherAmount = 0;
            if ($this->useVoucher){
                $voucherId = Voucher::where('code', $this->voucherCode)->first()->id;
                $voucherAmount = $this->voucherAmount;
            }

            $order = Order::create([
                'name' => $this->name,
                'family' => $this->family,
                'mobile' => $this->mobile,
                'email' => $this->email,
                'description' => $this->description,
				'province' =>  $this->province,
				'city' => $this->city,
				'postalCode' => $this->postalCode,
				'address' => $this->address,
                'price' => Cart::price(),
                'discount' => Cart::discount(),
                'voucher_id' => $voucherId,
                'voucher_amount' => $voucherAmount,
                'wallet_pay' => $this->walletAmount,
                'total_price' => Cart::total($this->walletAmount, $voucherAmount),
                'delivery_time' => Carbon::make(now())->addHours($timer),

                'user_id' => auth()->id(),
                'user_ip' => request()->ip(),
            ]);
---
insert into `orders` (`name`, `family`, `mobile`, `email`, `description`, `province`, `city`, `postalCode`, `address`, `price`, `discount`, `voucher_id`, `voucher_amount`, `wallet_pay`, `total_price`, `delivery_time`, `user_id`, `user_ip`, `updated_at`, `created_at`) values ('sadegh', 'taheryfar', '09981849573', 'tahryfrsadq@gmail.com', '', '', '', '', '', 2714000, 0, '', 0, 2714000, 0, '2024-02-13 22:56:53', 73531, '127.0.0.1', '2024-02-13 17:56:53', '2024-02-13 17:56:53')

				}
            }

            OrderNote::create([
                'note' => 'سفارش '.$order->tracking_code.' باموفقیت ثبت شد',
                'is_user_note' => 1,
                'is_read' => 0,
                'order_id' => $order->id,
            ]);
---
insert into `order_notes` (`note`, `is_user_note`, `is_read`, `order_id`, `updated_at`, `created_at`) values ('سفارش FAG-897886 باموفقیت ثبت شد', 1, 0, 7, '2024-02-13 17:56:53', '2024-02-13 17:56:53')

    public function checkVoucherCode()
    {
        $this->useVoucher = false;
        $this->voucherAmount = 0;
        $voucher = Voucher::where('code', $this->voucherCode);


		if (!empty($voucher->first()->expires_at))
		{
			$origin = date_create($voucher->first()->expires_at);
			$target = date_create(date('Y-m-d'));
			$interval = date_diff($target,$origin);
			if ((int)$interval->format("%r%a") < 0)
			{
				$this->addError('voucher', 'کد وارد شده  منقضی شده است');
				$this->calculatePrice();
				$this->voucherCode = null;
				return;
			}
		}


        //exists
        if (!$voucher->exists()){
---
select * from `vouchers` where `code` is null and `vouchers`.`deleted_at` is null limit 1
select exists(select * from `vouchers` where `code` is null and `vouchers`.`deleted_at` is null limit 1) as `exists`