app/Http/Controllers/Site/Header.php

    public function mount()
    {
		$site_status = Setting::where('name', 'site_close')->first()->value;

		if ($site_status == 1)
		{
			abort(503);
		}


        $this->notifications = Notification::all();
        if (auth()->check()){
            $this->userNotifications = OrderNote::where('is_read', 0)->whereHas('order', function ($query){
                return $query->where('user_id', auth()->id());
            })->where('is_user_note', 1)
                ->latest()
                ->take(10)
                ->get();
---
select * from `settings` where `name` = 'site_close' limit 1
select * from `notifications`
select * from `order_notes` where `is_read` = 0 and exists (select * from `orders` where `order_notes`.`order_id` = `orders`.`id` and `user_id` = 73531 and `orders`.`deleted_at` is null) and `is_user_note` = 1 and `order_notes`.`deleted_at` is null order by `created_at` desc limit 10