app/Http/Controllers/Site/Sidebar3.php

    public function mount($token = null)
    {
        $this->token = $token;
		$ordersOnline = OrderDetail::where('status','wc-processing')->orWhere('status','speed_plus')->orderBy('id','desc')->take(600)->get();
		$ordersLast = OrderDetail::where('status','wc-completed')->orderBy('id','desc')->take(600)->get();
---
select * from `order_details` where (`status` = 'wc-processing' or `status` = 'speed_plus') and `order_details`.`deleted_at` is null order by `id` desc limit 600
select * from `order_details` where `status` = 'wc-completed' and `order_details`.`deleted_at` is null order by `id` desc limit 600

    public function render()
    {
		$categories = Category::with('childrenRecursive')->where('parent_id',null)->get()->toArray();
---
select * from `categories` where `categories`.`parent_id` in (1, 5, 12, 23, 25, 27, 29, 31, 34, 37, 40, 43, 65, 67) and `categories`.`deleted_at` is null