app/Http/Controllers/Site/Sidebar.php

    public function mount($token = null)
    {
		$this->start_lottery = Setting::getSingleRow('lottery');
        $this->token = $token;
		$ordersOnline = OrderDetail::where('status','wc-processing')->has('product')->orderBy('id','desc')->take(600)->get();
		$ordersLast = OrderDetail::where('status','wc-completed')->has('product')->orderBy('id','desc')->take(600)->get();

		foreach($ordersLast as $item2)
		{
			$order_time = $item2->order->created_at->toArray();
			$origin = date_create($item2->order->created_at);
			$target = date_create(date('Y-m-d H:i:s'));
			$interval = date_diff($origin, $target);
			if ($interval->days == "0" && date("d") == $order_time['day']) {
				$this->ordersLasts++;
			}
		}
		$this->ordersLasts = $this->ordersLasts*2;
		foreach($ordersOnline as $item)
		{
			$order_time = $item->order->created_at->toArray();
---
select * from `order_details` where `status` = 'wc-processing' and exists (select * from `products` where `order_details`.`product_id` = `products`.`id` and `products`.`deleted_at` is null) and `order_details`.`deleted_at` is null order by `id` desc limit 600
select * from `order_details` where `status` = 'wc-completed' and exists (select * from `products` where `order_details`.`product_id` = `products`.`id` and `products`.`deleted_at` is null) and `order_details`.`deleted_at` is null order by `id` desc limit 600
select * from `orders` where `orders`.`id` = 2 and `orders`.`deleted_at` is null limit 1
select * from `orders` where `orders`.`id` = 6 and `orders`.`deleted_at` is null limit 1

    public function render()
    {
		$categories = Category::with('childrenRecursive')->where('parent_id',null)->get()->toArray();
---
select * from `categories` where `categories`.`parent_id` in (1, 5, 12, 23, 25, 27, 29, 31, 34, 37, 40, 43, 65, 67) and `categories`.`deleted_at` is null