app/Http/Controllers/Site/Products/ProductsComponent.php

    public function mount()
    {
        SEOMeta::setTitle('محصولات - فارس گیمر');
        SEOMeta::setDescription('خرید محصولات فورتنایت - خرید محصولات کالاف دیوتی موبایل - خرید پابجی - ارزان تر از همه جا - خرید ویباکس - خرید ویباکس ارزان -100% مشتریان راضی بوده اند');

        OpenGraph::setTitle('محصولات - فارس گیمر');
        OpenGraph::setDescription('خرید محصولات فورتنایت - خرید محصولات کالاف دیوتی موبایل - خرید پابجی - ارزان تر از همه جا - خرید ویباکس - خرید ویباکس ارزان -100% مشتریان راضی بوده اند');

        TwitterCard::setTitle('محصولات - فارس گیمر');
        TwitterCard::setDescription('خرید محصولات فورتنایت - خرید محصولات کالاف دیوتی موبایل - خرید پابجی - ارزان تر از همه جا - خرید ویباکس - خرید ویباکس ارزان -100% مشتریان راضی بوده اند');

        JsonLd::setTitle('محصولات - فارس گیمر');
        JsonLd::setDescription('خرید محصولات فورتنایت - خرید محصولات کالاف دیوتی موبایل - خرید پابجی - ارزان تر از همه جا - خرید ویباکس - خرید ویباکس ارزان -100% مشتریان راضی بوده اند');

        $this->sortable = ['latest' => 'جدید ترین', 'oldest' => 'قدیمی ترین',
            'price-asc' => 'ارزان ترین', 'price-desc' => 'گران ترین',
            Product::STATUS_AVAILABLE => 'محصولات موجود'
            ];
        $this->categories = Category::with('subCategories')->whereNull('parent_id')->get();
---
select * from `categories` where `categories`.`parent_id` in (1, 5, 12, 23, 25, 27, 29, 31, 34, 37, 40, 43, 65, 67) and `categories`.`deleted_at` is null

    public function render()
    {
        $products = Product::with('category')->fgtal()->orderBy('status')->latest();

        $products = $products->where('status', '!=', Product::STATUS_DRAFT);

        if ($this->category != 'all') {
            $category = Category::where('slug', $this->category)->firstOrFail();
            $products = $products->whereIn('category_id', $category->subCategories()->pluck('id')->push($category->id));
        }

        if ($this->q) {
            $products = $products->where('title', 'LIKE', '%' . $this->q . '%');
        }

        if ($this->sort == Product::STATUS_AVAILABLE) {
            $products->where('status', Product::STATUS_AVAILABLE);
        }

        $products = $products->paginate(20);
---
select count(*) as aggregate from `products` where `fgtal` = 0 and `status` != 'draft' and `title` LIKE '%awgawg%' and `products`.`deleted_at` is null