app/Http/Controllers/Site/Products/ProductComponent.php

select * from `products` where `slug` = 'call-of-duty-mobile' and `fgtal` = 0 and `status` != 'draft' and `products`.`deleted_at` is null limit 1
select * from `category_parameter` where `category_id` = 42
select count(*) as aggregate from `comments` where `commentable_type` = 'product' and `commentable_id` in (48402) and `is_confirmed` = 1 and `comments`.`deleted_at` is null
---
    public function mount($slug)
    {

		$this->start_lottery = Setting::getSingleRow('lottery');

        $this->product = Product::where('slug', $slug)->fgtal()->where('status', '!=', Product::STATUS_DRAFT)->firstOrFail();


		$product_parameters = $this->product->parameter()->get();
		$parameters =  CategoryParameter::where('category_id',$this->product->category_id)->get();
		foreach($parameters as $key => $parameter)
		{
			foreach ($product_parameters as $key2 => $product_parameter)
			{
				$atrValue = CategoryParameterProduct::where('product_id',$this->product->id)->where('parameter_id',$parameter->id)->firstOrFail()->value;
				if ($product_parameter->id == $parameter->id && !empty($atrValue))
				{
					$this->parametersValue[$parameter->id] = $atrValue;
					$this->parameters[$parameter->id] = $parameter;
				}
			}
		}


        SEOMeta::setTitle('خرید ' . $this->product->title . ' - فارس گیمر');
        SEOMeta::setDescription($this->product->seo_description);

        OpenGraph::setTitle('خرید ' . $this->product->title . ' - فارس گیمر');
		$this->commentsCount = Comment::where('commentable_type', 'product')->whereIn('commentable_id', [$this->product->id])->isConfirmed()->count();

select count(*) as aggregate from `questions` where `questions`.`product_id` = 48402 and `questions`.`product_id` is not null and `is_confirmed` = 1 and `questions`.`deleted_at` is null
select * from `categories` where `categories`.`id` = 42 and `categories`.`deleted_at` is null limit 1
select `id` from `categories` where `categories`.`parent_id` = 40 and `categories`.`parent_id` is not null and `categories`.`deleted_at` is null
---
        $this->priceWithDiscount = $this->product->price_with_discount;
		$this->detail_display = $this->product->detail_display;
        $this->avg = $this->product->comments()->isConfirmed()->avg('rating');
        $this->questionsCount = $this->product->questions()->isConfirmed()->count();

        $category = Category::find($this->product->category_id);

        if ($category->parent_id) {
            $category = $category->parent->subCategories()->pluck('id');

select * from `categories` where `categories`.`id` in (42, 48) and `categories`.`deleted_at` is null
select * from `products` where `category_id` in (41, 42, 48, 64) and `status` = 'available' and `products`.`deleted_at` is null order by RAND() limit 8
---
            $category = $category->subCategories()->pluck('id');
        }

        $this->relatedProducts = Product::with('category')->whereIn('category_id', $category)
            ->where('status', Product::STATUS_AVAILABLE)
            ->inRandomOrder()->take(8)->get();

select * from `comments` where `commentable_type` = 'product' and `commentable_id` in (48402) and `is_confirmed` = 1 and `comments`.`deleted_at` is null order by `created_at` desc limit 6 offset 0
select * from `users` where `users`.`id` in (49902, 62330, 84415, 84751, 85005)
select count(*) as aggregate from `comments` where `commentable_type` = 'product' and `commentable_id` in (48402) and `is_confirmed` = 1 and `comments`.`deleted_at` is null
select * from `questions` where `questions`.`product_id` = 48402 and `questions`.`product_id` is not null and `is_confirmed` = 1 and `parent_id` is null and `questions`.`deleted_at` is null order by `created_at` desc limit 6 offset 0
select count(*) as aggregate from `questions` where `questions`.`product_id` = 48402 and `questions`.`product_id` is not null and `is_confirmed` = 1 and `parent_id` is null and `questions`.`deleted_at` is null
---
    public function render()
    {
        if ($this->readyToLoad && !$this->isLoaded) {
            $products = [];
            foreach ($this->form as $item) {
                foreach ($item['options'] as $optionKey => $option) {
                    if (isset($option['license']) && $option['license'] != '') {
                        $products[] = $option['license'];
                    }
                }
            }

            $productsID = Product::whereIn('slug', $products)->get()->pluck('id')->toArray();
            $comments = Comment::where('commentable_type', 'product')
                ->with('user')
                ->whereIn('commentable_id', array_merge($productsID, [$this->product->id]))
                ->isConfirmed()
                ->orderBy('created_at', 'DESC')
                ->paginate($this->prePageComment)->setPageName('comments');

            $this->commentsCount = Comment::where('commentable_type', 'product')
                ->with('user')
                ->whereIn('commentable_id', array_merge($products, [$this->product->id]))
                ->isConfirmed()->count();

            $questions = $this->product->questions()->isConfirmed()->whereNull('parent_id')->orderBy('created_at', 'DESC')
                ->paginate($this->prePageQuestion)->setPageName('questions');