app/Http/Controllers/Admin/Settings/HomeComponent.php

    public function saveInDatabase()
    {
        Setting::updateOrCreate(['name' => 'image_special_discount'], ['value' => $this->imageSpecialDiscount]);
---
select * from `settings` where `name` in ('telegram', 'instagram', 'facebook', 'twitter')

	public function editBanner($id)
	{
		$this->setting_name = 'home_slider';
		$case = Setting::find($id);
---
select * from `settings` where `settings`.`id` = 434 limit 1