app/Http/Controllers/Site/Articles/ArticleComponent.php

select * from `articles` where `slug` = 'account-type' and `articles`.`deleted_at` is null limit 1
---
    public function mount($slug)
    {
        $this->article = Article::where('slug', $slug)->firstOrFail();