app/Http/Controllers/Site/Articles/ArticlesComponent.php

    public function render()
    {
        $articles = Article::latest()->paginate($this->perPage);
---
select * from `articles` where `articles`.`deleted_at` is null order by `created_at` desc limit 12 offset 0
select count(*) as aggregate from `articles` where `articles`.`deleted_at` is null