app/Http/Controllers/Site/Homes/HomeComponent.php

    public function mount()
    {
        // if (auth()->check()) {
        // 	if (auth()->id() != 55867) {
        // 		abort(503);
        // 	}
        // } else {
        // 	abort(503);

        // }

        SEOMeta::setTitle('فارس گیمر - اولین مرجع رسمی فروش بازی های آنلاین - گران نخرید ! خرید انواع بازی دیجیتال');
        SEOMeta::setDescription('خرید محصولات فورتنایت - خرید محصولات کالاف دیوتی موبایل - خرید پابجی - ارزان تر از همه جا - خرید ویباکس - خرید ویباکس ارزان -100% مشتریان راضی بوده اند');

        OpenGraph::setTitle('فارس گیمر - اولین مرجع رسمی فروش بازی های آنلاین - گران نخرید ! خرید انواع بازی دیجیتال');
        OpenGraph::setDescription('خرید محصولات فورتنایت - خرید محصولات کالاف دیوتی موبایل - خرید پابجی - ارزان تر از همه جا - خرید ویباکس - خرید ویباکس ارزان -100% مشتریان راضی بوده اند');

        TwitterCard::setTitle('فارس گیمر - اولین مرجع رسمی فروش بازی های آنلاین - گران نخرید ! خرید انواع بازی دیجیتال');
        TwitterCard::setDescription('خرید محصولات فورتنایت - خرید محصولات کالاف دیوتی موبایل - خرید پابجی - ارزان تر از همه جا - خرید ویباکس - خرید ویباکس ارزان -100% مشتریان راضی بوده اند');

        JsonLd::setTitle('فارس گیمر - اولین مرجع رسمی فروش بازی های آنلاین - گران نخرید ! خرید انواع بازی دیجیتال');
        JsonLd::setDescription('خرید محصولات فورتنایت - خرید محصولات کالاف دیوتی موبایل - خرید پابجی - ارزان تر از همه جا - خرید ویباکس - خرید ویباکس ارزان -100% مشتریان راضی بوده اند');




        $settings = Setting::whereIn('name', [
            'home_slider', 'triple_item', 'best_seller', 'fortnite', 'physical', 'steam', 'gift_carts',
            'image_special_discount', 'slug_one_special_discount', 'slug_two_special_discount', 'slug_three_special_discount', 'home_article'
        ])->get();

        $this->headerSlider = Setting::where('name', 'home_slider')->orderBy('priority')->pluck('value', 'id');
---
select * from `settings` where `name` in ('home_slider', 'triple_item', 'best_seller', 'fortnite', 'physical', 'steam', 'gift_carts', 'image_special_discount', 'slug_one_special_discount', 'slug_two_special_discount', 'slug_three_special_discount', 'home_article')
select `value`, `id` from `settings` where `name` = 'home_slider' order by `priority` asc


        $this->imageSpecialDiscount = $settings->where('name', 'image_special_discount')->first()->value ?? '';

        $products = Product::with(['category', 'currency'])
            ->fgtal()
            ->whereIn('slug', array_merge(
                $bestSellers,
                $fortnite,
                $physical,
                $steam,
                $settings->whereIn('name', ['slug_one_special_discount', 'slug_two_special_discount', 'slug_three_special_discount'])
                    ->pluck('value')->toArray()
            ))->get();

        $this->bestSellers = $products->whereIn('slug', $bestSellers);
        $this->BestSellersNew = $products->whereIn('slug', $bestSellers)->take(5);
        $this->GiftCardsNew = Product::whereIn('slug', $GiftCardsNew)->where("status","available")->take(5)->get();
        $this->SpecialDiscountsNew = Product::where('discount_amount',"!=", 0)->where("status","available")->take(5)->get();
---
select * from `categories` where `categories`.`id` in (2, 7, 8, 13, 14, 15, 18, 19, 24, 26, 38, 42, 45) and `categories`.`deleted_at` is null
select * from `currencies` where `currencies`.`id` in (1, 3, 6) and `currencies`.`deleted_at` is null
select * from `products` where `slug` in ('giftcardamazon-us', 'playstationgiftcard', 'giftcard-googleplay', 'giftcard-itunes', 'giftcardxbox-usa', 'giftcardsteam') and `status` = 'available' and `products`.`deleted_at` is null limit 5
select * from `products` where `discount_amount` != 0 and `status` = 'available' and `products`.`deleted_at` is null limit 5

        $this->specialDiscountOne = $products->whereIn('slug', $settings->where('name', 'slug_one_special_discount')->pluck('value'))->first();
        $this->specialDiscountTwo = $products->whereIn('slug', $settings->where('name', 'slug_two_special_discount')->pluck('value'))->first();
        $this->specialDiscountThree = $products->whereIn('slug', $settings->where('name', 'slug_three_special_discount')->pluck('value'))->first();
        $id = Category::where('slug', '=', 'steam-game')->pluck('id')->toArray();
        $this->steamGames = Product::where('category_id', $id[0])->take(12)->get();
        $this->MouseProduct = Product::where('category_id', "14")->where("status","available")->take(8)->get();
        $this->recentComments = Comment::with('user')
            ->latest()
            ->isConfirmed()
            ->where('commentable_type', 'product')
            ->take(12)->get();

        $articles = Article::whereIn('slug', $article)->get();
---
select `id` from `categories` where `slug` = 'steam-game' and `categories`.`deleted_at` is null
select * from `products` where `category_id` = 24 and `products`.`deleted_at` is null limit 12
select * from `products` where `category_id` = '14' and `status` = 'available' and `products`.`deleted_at` is null limit 8
select * from `comments` where `is_confirmed` = 1 and `commentable_type` = 'product' and `comments`.`deleted_at` is null order by `created_at` desc limit 12
select * from `users` where `users`.`id` in (8781, 40800, 41299, 52333, 61845, 73201, 74640, 83904, 84751, 84947, 84972, 85005)
select * from `articles` where `slug` in ('region-account-steam', 'two-step-ps4', 'two-step-epic', 'link-psn-to-epic', 'account-type') and `articles`.`deleted_at` is null