app/Http/Controllers/Site/Homes/HomeComponent2.php

    public function mount()
    {
        SEOMeta::setTitle('فارس گیمر - اولین مرجع رسمی فروش بازی های آنلاین - گران نخرید ! خرید انواع بازی دیجیتال');
        SEOMeta::setDescription('خرید محصولات فورتنایت - خرید محصولات کالاف دیوتی موبایل - خرید پابجی - ارزان تر از همه جا - خرید ویباکس - خرید ویباکس ارزان -100% مشتریان راضی بوده اند');

        OpenGraph::setTitle('فارس گیمر - اولین مرجع رسمی فروش بازی های آنلاین - گران نخرید ! خرید انواع بازی دیجیتال');
        OpenGraph::setDescription('خرید محصولات فورتنایت - خرید محصولات کالاف دیوتی موبایل - خرید پابجی - ارزان تر از همه جا - خرید ویباکس - خرید ویباکس ارزان -100% مشتریان راضی بوده اند');

        TwitterCard::setTitle('فارس گیمر - اولین مرجع رسمی فروش بازی های آنلاین - گران نخرید ! خرید انواع بازی دیجیتال');
        TwitterCard::setDescription('خرید محصولات فورتنایت - خرید محصولات کالاف دیوتی موبایل - خرید پابجی - ارزان تر از همه جا - خرید ویباکس - خرید ویباکس ارزان -100% مشتریان راضی بوده اند');

        JsonLd::setTitle('فارس گیمر - اولین مرجع رسمی فروش بازی های آنلاین - گران نخرید ! خرید انواع بازی دیجیتال');
        JsonLd::setDescription('خرید محصولات فورتنایت - خرید محصولات کالاف دیوتی موبایل - خرید پابجی - ارزان تر از همه جا - خرید ویباکس - خرید ویباکس ارزان -100% مشتریان راضی بوده اند');




        $settings = Setting::whereIn('name', [
            'home_slider', 'triple_item', 'best_seller', 'fortnite', 'physical', 'steam', 'gift_carts',
            'image_special_discount', 'slug_one_special_discount', 'slug_two_special_discount', 'slug_three_special_discount','home_article'
        ])->get();

        $this->headerSlider = Setting::where('name', 'home_slider')->orderBy('priority')->pluck('value', 'id');
---
select * from `settings` where `name` in ('home_slider', 'triple_item', 'best_seller', 'fortnite', 'physical', 'steam', 'gift_carts', 'image_special_discount', 'slug_one_special_discount', 'slug_two_special_discount', 'slug_three_special_discount', 'home_article')
select `value`, `id` from `settings` where `name` = 'home_slider' order by `priority` asc


        $this->imageSpecialDiscount = $settings->where('name', 'image_special_discount')->first()->value ?? '';

        $products = Product::with(['category', 'currency'])
            ->whereIn('slug', array_merge($bestSellers, $fortnite, $physical, $steam,
                $settings->whereIn('name', ['slug_one_special_discount', 'slug_two_special_discount', 'slug_three_special_discount'])
                    ->pluck('value')->toArray()))->get();
---
select * from `categories` where `categories`.`id` in (2, 3, 4, 7, 8, 13, 14, 15, 18, 19, 24, 26, 30, 38, 42, 44, 45, 46, 47, 48) and `categories`.`deleted_at` is null
select * from `currencies` where `currencies`.`id` in (1, 2, 3, 4, 6) and `currencies`.`deleted_at` is null
select * from `products` where `slug` in ('warzone-burgerking', 'warzone-jacklinks', 'giftcardpsn10', 'vp740tr', 'vp175tr', 'changeepiccototr', 'changecototr', 'itemshopefort', 'freefire', 'crew-pack', 'apex-coins', 'nod-the-eternal-pack', 'HP-OMEN-X-25', 'hp-omen-x', 'game-steam', 'call-of-duty-mobile', 'game-epic', 'battelpass', 'giftingfortnite', 'pubg-mobile', 'starter-pack-fortnite', 'gilded-elites-pack', 'voidlands-exile-quest-pack', 'razer-viper-ultimate', 'aula-f805', 'glorious-model-d', '1000-vbucks', 'starter-pack-fortnite', '2800vbucks', '5000-vbucks', '13500-vbucks', 'battelpass', 'cougar-outrider-black', 'cougar-armor-one-roya', 'hyperx-solocast', 'k613-jax-pro', 'logitech-g413-carbon', 'steelseriesa-pro-tkl', 'rainbow-six-siege', 'fall-guys', 'tekken', 'phasmophobia', 'dayz', 'monster-hunter-world', 'among-us', 'ark-survival-evolved', 'in-silence', 'the-forest', 'portal-2', 'mortal-kombat-11', 'squad', 'for-honor-starter-edition', 'scum', 'sea-of-thieves', 'rust', 'cyberpunk-2077', 'ghostrunner', 'mafia-definitive-edition', 'mafia-ii-definitive-edition', 'mafia-iii-definitive-edition', 'the-crew-2', 'human-fall-flat', 'arma-3', 'age-of-empires-iii-definitive-edition', 'fifa-23', 'asus-vg249q1r', 'kg241qs', 'acer-kg1', 'aoc-g2490vx', 'fantech-chimera-gm271sf', 'tidal-music', 'spotify', 'apple-music', 'exitlag', 'netflix', 'youtube', 'hp-omen-x', 'hp-omen-x', 'call-of-duty-mobile', 'playstationgiftcard') and `products`.`deleted_at` is null

        $this->specialDiscountOne = $products->whereIn('slug', $settings->where('name', 'slug_one_special_discount')->pluck('value'))->first();
        $this->specialDiscountTwo = $products->whereIn('slug', $settings->where('name', 'slug_two_special_discount')->pluck('value'))->first();
        $this->specialDiscountThree = $products->whereIn('slug', $settings->where('name', 'slug_three_special_discount')->pluck('value'))->first();
		$id = Category::where('slug','=','steam-game')->pluck('id')->toArray();
		$this->steamGames = Product::where('category_id',$id[0])->take(12)->get();
        $this->recentComments = Comment::with('user')
            ->latest()
            ->isConfirmed()
            ->where('commentable_type', 'product')
            ->take(12)->get();

			$articles = Article::whereIn('slug', $article)->get();
---
select `id` from `categories` where `slug` = 'steam-game' and `categories`.`deleted_at` is null
select * from `products` where `category_id` = 24 and `products`.`deleted_at` is null limit 12
select * from `comments` where `is_confirmed` = 1 and `commentable_type` = 'product' and `comments`.`deleted_at` is null order by `created_at` desc limit 12
select * from `users` where `users`.`id` in (8781, 40800, 41299, 52333, 61845, 73201, 74640, 83904, 84751, 84947, 84972, 85005)
select * from `articles` where `slug` in ('region-account-steam', 'two-step-ps4', 'two-step-epic', 'link-psn-to-epic', 'account-type', 'link-guest-to-activision') and `articles`.`deleted_at` is null