app/Http/Controllers/Admin/Users/StoreUser.php

select * from `overtimes` where `user_id` = 73531
---
    public function render()
    {
		if($this->mode == "update"){
			$this->overtimes = Overtime::where('user_id',$this->model->id)->get();