app/Models/Setting.php

select * from `settings` where `name` = 'lottery' limit 1
---
    public static function getSingleRow($name, $default = '')
    {
        return Setting::where('name', $name)->first()->value ?? $default;