app/Models/User.php

select * from `languages` where `basic` LIKE '%صفحه اصلی%' limit 1
---
	public function translate($word)
	{
		$base_word = Language::where('basic','LIKE','%'.$word.'%')->first();