app/Http/Controllers/Site/Dashboard/Sidebar.php

    public function render()
    {
		$this->lottery = 0;
		$lottery_date = Setting::getSingleRow('start_lottery');
		$this->start_lottery = Setting::getSingleRow('lottery');
		$end = Carbon::now()->format('Y-m-d H:i:s');
		if ($this->start_lottery){
			$orders = auth()->user()->orders()->whereBetween('created_at', [$lottery_date.' 00:00:00', $end])->whereHas('details',function($query){
				return $query->where(function($query){
					return $query->where('status',Order::STATUS_COMPLETED);
				});
			})->get();
			foreach ($orders as $order){
				foreach ($order->details as $item){
					if(!is_null($item->product))
						$this->lottery = $this->lottery + $item->product->lottery*$item->quantity;
				}
			}
		}

        $deposit = Score::where('user_id', auth()->id())
            ->where('type', Score::TYPE_DEPOSIT)->sum('amount');
        $withdraw = Score::where('user_id', auth()->id())
            ->where('type', Score::TYPE_WITHDRAW)->sum('amount');
---
select sum(`amount`) as aggregate from `scores` where `user_id` = 73531 and `type` = 'deposit'
select sum(`amount`) as aggregate from `scores` where `user_id` = 73531 and `type` = 'withdraw'